Autodesk.Revit.DB.BuiltInFailures.ElementFailures.SplitElementHasTagsWithoutLeaders
The split element has one or more Tags without Leaders enabled and needs to be checked.

Autodesk.Revit.DB.BuiltInFailures.ElementFailures.NotAllowedToRemoveAllElements
You cannot removed all the elements from current solution. At least there should be two elements in the solution.

Autodesk.Revit.DB.BuiltInFailures.ElementFailures.FailedToRemoveElement
Element cannot be removed from the solution. The solution is required to have at least two elements to be valid.

Autodesk.Revit.DB.BuiltInFailures.ElementFailures
Failures about Elements.